{
  "_name_or_path": "roberta-base",
  "architectures": [
    "RobertaForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 0,
  "classifier_dropout": null,
  "eos_token_id": 2,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "book_flight",
    "1": "cancel_alarm",
    "2": "goodbye",
    "3": "greet",
    "4": "navigate",
    "5": "order_pizza",
    "6": "play_music",
    "7": "reminder",
    "8": "send_email",
    "9": "set_alarm",
    "10": "small_talk",
    "11": "tell_joke",
    "12": "thank_you",
    "13": "time",
    "14": "weather"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "book_flight": 0,
    "cancel_alarm": 1,
    "goodbye": 2,
    "greet": 3,
    "navigate": 4,
    "order_pizza": 5,
    "play_music": 6,
    "reminder": 7,
    "send_email": 8,
    "set_alarm": 9,
    "small_talk": 10,
    "tell_joke": 11,
    "thank_you": 12,
    "time": 13,
    "weather": 14
  },
  "layer_norm_eps": 1e-05,
  "max_position_embeddings": 514,
  "model_type": "roberta",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 1,
  "position_embedding_type": "absolute",
  "problem_type": "single_label_classification",
  "torch_dtype": "float32",
  "transformers_version": "4.44.2",
  "type_vocab_size": 1,
  "use_cache": true,
  "vocab_size": 50265
}
