{
  "_name_or_path": "distilbert-base-uncased",
  "activation": "gelu",
  "architectures": [
    "DistilBertForSequenceClassification"
  ],
  "attention_dropout": 0.1,
  "dim": 768,
  "dropout": 0.1,
  "hidden_dim": 3072,
  "id2label": {
    "0": "book_flight",
    "1": "cancel_alarm",
    "2": "goodbye",
    "3": "greet",
    "4": "navigate",
    "5": "order_pizza",
    "6": "play_music",
    "7": "reminder",
    "8": "send_email",
    "9": "set_alarm",
    "10": "small_talk",
    "11": "tell_joke",
    "12": "thank_you",
    "13": "time",
    "14": "weather"
  },
  "initializer_range": 0.02,
  "label2id": {
    "book_flight": 0,
    "cancel_alarm": 1,
    "goodbye": 2,
    "greet": 3,
    "navigate": 4,
    "order_pizza": 5,
    "play_music": 6,
    "reminder": 7,
    "send_email": 8,
    "set_alarm": 9,
    "small_talk": 10,
    "tell_joke": 11,
    "thank_you": 12,
    "time": 13,
    "weather": 14
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "problem_type": "single_label_classification",
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "torch_dtype": "float32",
  "transformers_version": "4.44.2",
  "vocab_size": 30522
}
